using System.Collections.Generic;
using System.Linq;

namespace Botva2025;

internal class Akcii
{
	public static Dictionary<string, string> AkciiString()
	{
		return new Dictionary<string, string>
		{
			["----------------"] = "NULL",
			["Приключение"] = "Prikluchenie",
			["Контрабанда"] = "Kontrabanda",
			["Песочница"] = "Pesochnica",
			["Парящие острова"] = "ParyshieOstrova",
			["Атлантида"] = "Atlantida",
			["АльфаСырТавра"] = "AlfaCyrTavra",
			["Предсказания"] = "Predskazanie",
			["ЗолотаяЛихорадка"] = "ZolotayLishoradka",
			["Монстроград"] = "Monstrograd",
			["Дух Рождества"] = "DyxRojdestva",
			["НаОрбиту"] = "NaOrbitu",
			["ПиратыМоря"] = "PiratyMory",
			["ЗельяВари"] = "ZeliyVari",
			["Наставления"] = "Nastavleniy",
			["Ботвадром"] = "BotvaDrom",
			["Скачки"] = "BotvaSkachki",
			["Рыбалка"] = "Rybalka",
			["МоЗайка"] = "MoZayka",
			["Паровозик"] = "Parovoz"
		};
	}

	public static Dictionary<int, string> AkciiDictionary()
	{
		Dictionary<string, string> source = AkciiString();
		return source.Select((KeyValuePair<string, string> kvp, int i) => new
		{
			Key = i,
			Value = kvp.Key
		}).ToDictionary(x => x.Key, x => x.Value);
	}

	public static Dictionary<string, int[]> AkciiShedevr()
	{
		Dictionary<string, int[]> dictionary = new Dictionary<string, int[]>();
		dictionary["-------"] = new int[64];
		dictionary["Кактус"] = new int[64]
		{
			0, 0, 1, 1, 1, 1, 0, 0, 0, 0,
			1, 0, 0, 1, 0, 0, 0, 1, 0, 0,
			0, 1, 1, 0, 0, 1, 1, 0, 0, 0,
			1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
			0, 1, 0, 0, 0, 1, 1, 0, 0, 1,
			1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
			0, 1, 0, 0
		};
		dictionary["Щупальце Октопуса"] = new int[64]
		{
			1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
			0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
			1, 1, 0, 1, 1, 0, 1, 0, 0, 1,
			0, 1, 1, 0, 1, 0, 1, 1, 0, 1,
			1, 0, 1, 0, 0, 0, 0, 1, 1, 0,
			1, 1, 1, 1, 1, 1, 1, 0, 0, 0,
			0, 0, 0, 0
		};
		dictionary["Жук"] = new int[64]
		{
			1, 0, 0, 0, 0, 0, 0, 1, 1, 1,
			0, 1, 1, 0, 1, 1, 0, 1, 1, 1,
			1, 1, 1, 0, 0, 1, 1, 0, 0, 1,
			1, 0, 0, 0, 1, 1, 1, 1, 0, 0,
			0, 1, 1, 1, 1, 1, 1, 0, 0, 1,
			0, 1, 1, 0, 1, 0, 1, 1, 0, 0,
			0, 0, 1, 1
		};
		dictionary["Кирка"] = new int[64]
		{
			0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
			1, 1, 1, 0, 0, 0, 0, 1, 1, 0,
			0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
			0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
			1, 0, 0, 0, 0, 1, 0, 0, 1, 0,
			0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
			0, 0, 0, 1
		};
		dictionary["Карта подземелий"] = new int[64]
		{
			0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
			0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
			0, 0, 0, 0, 1, 1, 0, 0, 1, 1,
			0, 1, 1, 1, 1, 0, 1, 0, 0, 0,
			1, 1, 0, 0, 1, 0, 1, 0, 0, 0,
			0, 0, 1, 1, 1, 1, 1, 1, 1, 0,
			0, 0, 0, 0
		};
		dictionary["Пальма"] = new int[64]
		{
			0, 1, 1, 1, 1, 1, 1, 0, 1, 1,
			0, 1, 1, 0, 1, 1, 1, 0, 0, 1,
			1, 0, 1, 1, 1, 0, 0, 1, 1, 0,
			0, 1, 0, 0, 0, 1, 1, 0, 0, 0,
			0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
			0, 1, 1, 0, 0, 0, 0, 0, 0, 1,
			1, 0, 0, 0
		};
		dictionary["Костёр"] = new int[64]
		{
			0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
			0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
			1, 1, 0, 0, 0, 1, 1, 1, 0, 1,
			1, 0, 1, 1, 1, 1, 1, 0, 1, 1,
			0, 1, 1, 0, 1, 1, 1, 0, 0, 0,
			1, 1, 1, 1, 0, 0, 0, 1, 1, 1,
			1, 1, 1, 0
		};
		dictionary["Планета"] = new int[64]
		{
			0, 0, 1, 1, 1, 1, 0, 0, 0, 1,
			1, 1, 1, 1, 1, 0, 1, 1, 0, 0,
			1, 1, 1, 1, 1, 1, 0, 1, 1, 0,
			1, 1, 1, 1, 1, 1, 0, 0, 1, 1,
			1, 1, 0, 1, 1, 1, 1, 1, 0, 1,
			1, 1, 1, 1, 1, 0, 0, 0, 1, 1,
			1, 1, 0, 0
		};
		dictionary["Дракон"] = new int[64]
		{
			0, 1, 1, 1, 0, 0, 0, 0, 0, 0,
			0, 1, 0, 0, 1, 0, 0, 0, 0, 1,
			0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
			0, 1, 0, 1, 1, 1, 0, 0, 1, 0,
			0, 1, 1, 1, 1, 1, 0, 0, 0, 1,
			1, 1, 1, 1, 0, 0, 1, 0, 1, 0,
			1, 0, 1, 0
		};
		dictionary["Гора"] = new int[64]
		{
			1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
			1, 0, 0, 1, 1, 1, 1, 1, 0, 0,
			0, 0, 1, 1, 1, 0, 0, 0, 0, 0,
			0, 1, 0, 0, 1, 1, 1, 1, 0, 0,
			0, 1, 1, 1, 1, 1, 1, 0, 1, 1,
			1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
			1, 1, 1, 1
		};
		dictionary["Пирашки"] = new int[64]
		{
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			1, 1, 1, 0, 0, 0, 0, 1, 1, 1,
			1, 1, 0, 1, 1, 1, 0, 1, 1, 1,
			1, 0, 1, 1, 1, 1, 1, 1, 1, 0,
			0, 1, 1, 1, 1, 1, 0, 1, 0, 0,
			1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0
		};
		dictionary["Улитка"] = new int[64]
		{
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
			1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
			0, 0, 1, 0, 1, 0, 1, 1, 0, 1,
			1, 1, 1, 0, 1, 1, 1, 1, 0, 0,
			0, 0, 1, 1, 0, 1, 1, 1, 1, 1,
			1, 1, 1, 1
		};
		dictionary["Дозорный"] = new int[64]
		{
			0, 0, 1, 1, 1, 1, 0, 0, 0, 0,
			1, 0, 0, 1, 0, 0, 0, 0, 1, 1,
			1, 1, 0, 0, 0, 1, 0, 1, 1, 0,
			1, 0, 1, 0, 0, 1, 1, 0, 0, 1,
			0, 0, 1, 1, 1, 1, 0, 0, 0, 0,
			1, 0, 0, 1, 0, 0, 0, 0, 1, 1,
			0, 1, 1, 0
		};
		dictionary["Поле битвы"] = new int[64]
		{
			1, 1, 1, 1, 1, 1, 0, 0, 1, 0,
			0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
			1, 0, 0, 1, 1, 0, 1, 1, 0, 1,
			0, 1, 1, 0, 1, 0, 1, 1, 0, 1,
			1, 0, 0, 1, 1, 1, 0, 1, 0, 0,
			0, 0, 0, 0, 0, 1, 0, 0, 1, 1,
			1, 1, 1, 1
		};
		dictionary["Череп"] = new int[64]
		{
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			1, 1, 1, 1, 0, 0, 0, 1, 1, 1,
			1, 1, 1, 0, 0, 1, 0, 1, 1, 0,
			1, 0, 0, 1, 1, 1, 1, 1, 1, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			1, 1, 1, 1, 0, 0, 0, 0, 0, 1,
			1, 0, 0, 0
		};
		dictionary["Вагонетка"] = new int[64]
		{
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 1, 1, 1, 1, 1, 1, 1, 1,
			1, 0, 0, 1, 1, 0, 0, 0, 0, 0,
			0, 1, 1, 0, 0, 0, 0, 0, 0, 1,
			1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
			1, 0, 0, 1, 1, 0, 0, 1, 1, 0,
			0, 1, 1, 0
		};
		dictionary["Бобёр"] = new int[64]
		{
			0, 1, 1, 1, 1, 1, 1, 0, 1, 1,
			1, 1, 1, 1, 1, 1, 1, 0, 0, 1,
			1, 0, 0, 1, 1, 1, 1, 1, 1, 1,
			1, 1, 1, 1, 0, 0, 0, 0, 1, 1,
			1, 0, 0, 1, 1, 0, 0, 1, 1, 0,
			1, 0, 0, 1, 0, 1, 0, 1, 1, 0,
			0, 1, 1, 0
		};
		dictionary["Устрашатель"] = new int[64]
		{
			1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
			0, 1, 1, 0, 0, 1, 1, 0, 0, 1,
			1, 0, 0, 1, 1, 1, 1, 1, 1, 1,
			1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 1, 0, 1, 1, 0, 1, 0, 0, 1,
			0, 1, 1, 0, 1, 0, 1, 0, 0, 0,
			0, 0, 0, 1
		};
		dictionary["Вилы"] = new int[64]
		{
			0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
			0, 1, 0, 0, 1, 0, 0, 0, 1, 1,
			0, 1, 0, 0, 0, 0, 1, 1, 1, 0,
			0, 1, 0, 0, 0, 1, 1, 1, 1, 0,
			0, 0, 1, 0, 1, 1, 0, 0, 0, 1,
			0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
			0, 0, 0, 0
		};
		dictionary["Клетка"] = new int[64]
		{
			0, 1, 0, 1, 0, 1, 0, 1, 1, 1,
			1, 1, 1, 1, 1, 1, 0, 1, 0, 1,
			0, 1, 0, 1, 1, 1, 1, 1, 1, 1,
			1, 1, 0, 1, 0, 1, 0, 1, 0, 1,
			1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
			0, 1, 0, 1, 0, 1, 1, 1, 1, 1,
			1, 1, 1, 1
		};
		return dictionary;
	}
}
